#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.keycloak_openid_user_session_note_protocol_mapper.Client-ID will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-ID" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientId"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client ID"
      + realm_id            = "moh_applications"
      + session_note        = "clientId"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.keycloak_openid_user_session_note_protocol_mapper.Client-IP-Address will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-IP-Address" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientAddress"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client IP Address"
      + realm_id            = "moh_applications"
      + session_note        = "clientAddress"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-CONSUMER.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate accces tokens for the internal PLR QA team with the PLR CONSUMER role" -> "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR QA team with the PLR CONSUMER role"
        id                                         = "77fc59ec-16d3-4416-96e6-4b3286236a66"
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate accces tokens for the internal PLR QA team with the PLR DSR_USER role" -> "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR QA team with the PLR DSR_USER role"
        id                                         = "bf1a894f-9665-42b7-96e5-c9ee90bef5fb"
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate accces tokens for the internal PLR QA team with the PLR MOH_APPROVER role" -> "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR QA team with the PLR MOH_APPROVER role"
        id                                         = "e6dc2c15-abb0-4a31-83ba-90ccae0e740f"
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate accces tokens for the internal PLR QA team with the PLR PRIMARY_SOURCE role" -> "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR QA team with the PLR PRIMARY_SOURCE role"
        id                                         = "3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41"
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate accces tokens for the internal PLR QA team with the PLR REG_ADMIN role" -> "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR QA team with the PLR REG_ADMIN role"
        id                                         = "c2d45ac3-fd76-4dfd-a309-034eb83f7555"
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ description                                = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate accces tokens for the internal PLR QA team with the PLR SECONDARY_SOURCE role" -> "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources. This client will be used to generate access tokens for the internal PLR QA team with the PLR SECONDARY_SOURCE role"
        id                                         = "ebf19db5-ab2e-4698-9a46-fa6b0138ab95"
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/CONSUMER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "d3dc70e8-af0e-4cb9-9e79-3706c94fd8da"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PLR-LRA.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "20e896f4-bf43-43ed-9441-d166e0513f34"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "CONSUMER"
      + service_account_user_id = (known after apply)
    }

Plan: 8 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*